#include <iostream>

int main() {
    int n, x, sum;
    for(int n = 0; n < 7; ++n) {
        for(sum = 0, x = 1; x <= n; ++x) {
            // Тази част sum = 0, x = 1 се изпълнява винаги преди проверката x <= n за конкретното n.
            //Така че дори при n = 0, когато 1 <= 0 е невярно и тялото не се изпълнява, следващия път, 
            // когато се влезе отново в този вътрешен цикъл (например при n = 1), x пак се присвоява на 1.
            sum += n;
        }
    }
    std::cout<< sum << std::endl;
}