#include <iostream>
 int main(int, char**) {
    const float STEP = 0.30;
    // ако стъпката не е степен на двойката, поради загуба на точност, може да се получи грешка. При предтавянето на float 
    // числата с плаваща запетая заради експоненталната форма, някои числа не могат да се представят точно.
    // В слуая 0,25 е степен на двойката, но ако бяхме взели 0,30 се натрупва грешка, която води до това, че
    // x не е равно на 1,5, а на 1,7999
    float x = STEP;
    // в C++ няма проблем да присвояваш стойността на константна променлива (const) на обикновена променлива — стига присвояването да е по стойност, а не по референция
    x = x + STEP;
    x += STEP;
    x += STEP;
    x += STEP;
    x += STEP;
    if(x == 1.5) {
        std::cout<< "Yes!" << std::endl;

    } else {
        std::cout<< sizeof(x) << std::endl;

        std::cout.precision(15);
        std::cout<< "No! x = " <<  x << std::endl;

    }

    return 0;
}